'use strict'
/*

1. 10 плюс 10 получаем 20, конкатенируем 10 (строка) получаем 2010

2. к 10 конкатенируем 10 (строка) прибавляем 10 получаем 101010 (число "клеится" к строке)

3. 10 плюс 10 получаем 20, прибавляем ничего получаем опять 20, конкатенируем 10 (строка) получаем 30 (перевод строки в число)

4. 10 делим на минус пустую строку - ошибка (деление на 0)

5. 10 делим на плюс 2,5 (строка) - ошибка (запятая вместо точки)

*/

let result1 = 10 + 10 + "10";
let result2 = 10 + "10" + 10;
let result3 = 10 + 10 + +"10";
let result4 = 10/-"";
let result5 = 10/+"2,5";

console.log(result1);
console.log(result2);
console.log(result3);
console.log(result4);
console.log(result5);